<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link href="https://fonts.googleapis.com/css?family=Roboto:100,100i,300,300i,400,400i,500,500i,700,700i,900,900i&amp;subset=cyrillic" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css?family=Roboto+Slab:100,300,400,700|Roboto:100,100i,300,300i,400,400i,500,500i,700,700i,900,900i&amp;subset=cyrillic" rel="stylesheet">
    <link rel="icon" href="yellow-square-md.png">
    <link rel="stylesheet" href="typo.css">
    <title>Типографика</title>
</head>
<body class="dark">

<div class="page sup-typo dark shadow" id="page">

    <h1 class="title">Типографика в вебе</h1>
    <p><a href="https://habr.com/post/324944/">Оригинальная статья на Хабре</a></p>

    <h2>Оглавление:</h2>
    <ol>
        <li><a href="#О-статье">О статье</a></li>
        <li><a href="#Термины">Термины</a></li>
        <li><a href="#Что-мы-делаем-не-так?">Что мы делаем не так?</a></li>
    </ol>

    <h1 id="О-статье">О статье</h1>
    <p>Статья поможет разобраться с основными терминами в типографике. А чтобы информация лучше и легче воспринималась, скучные тексты проиллюстрированы веселыми картинками. Так же в статье собраны самые распространенные ошибки, которые допускаются веб-дизайнерами при работе с текстом и даны рекомендации как их избежать. </p>

    <img src="https://habrastorage.org/getpro/habr/post_images/124/976/f54/124976f543e765051e15b200b6702ce3.jpg">



    <p class="marked shadow" id="Термины"><b>Типографика</b> — сильнейший инструмент для выражения посыла в веб-дизайне. С его помощью вы можете объединить текстовую и визуальную составляющие, что поможет вам достучаться до посетителя. Правильное использование типографики поможет избежать типичных ошибок, допускаемых дизайнерами при создании очередного шедевра. Постараемся понять, что же мы делаем не так, и как избежать ошибок в будущем.</p>

    <p>Для начала давайте разберемся с терминологией. Наверняка большинство терминов вам знакомы, но еще разок ознакомиться с определениями не будет лишним. Возможно, это дополнит ту информацию, которой вы уже обладаете.</p>

    <p><b>Типографика</b> — свод законов, правил и норм оформления текста, основанных на изучении восприятия набора читателем. Знание и понимание типографики превращают текст в инструмент построения композиции, делают его живым, придают характер и способность передать идею не только при помощи содержания, но и графически.</p>

    <p><b>Гарнитура</b> — шрифт или несколько шрифтов, имеющих стилистическое единство начертания. Состоит из набора знаков. Часто это понятие путают с понятием «шрифт», хотя шрифт — это определенное начертание знаков, в то время как гарнитура определяет общее «семейство» шрифтов.</p>

    <img src="https://habrastorage.org/getpro/habr/post_images/408/152/9e5/4081529e517c2cab059ce49030c539d6.jpg">

    <p>Гарнитуры можно разделить на две основные категории:</p>

    <ul>
        <li><b>Антиква</b> — шрифты с засечками.</li>
        <li><b>Гротеск</b>, соответственно, — шрифт без засечек.</li>
    </ul>

    <p>В проектах можно использовать любой, правильного и неправильного варианта тут нет. Нужно смотреть по ситуации, какой проект вы делаете и что более актуально для него.</p>

    <img src="https://habrastorage.org/getpro/habr/post_images/628/655/d62/628655d62c82b1f2fea6d60f820bb45f.jpg">

    <p>Шрифт с засечками, как бы держит строку, а соответственно повышается удобочитаемость. Часто шрифты с засечками создают ощущение профессионализма и авторитетности предоставляемой информации, выражают уважение, подчеркивают стабильность и консерватизм в лучшем понимании этого слова. Шрифты без засечек, как правило, акцентируют рациональность, следование стилю, молодость и современность. Помогают создать пространство между буквами, а также отделить один знак от другого.</p>

    <p><b>Кегль</b> — высота буквы, включающая в себя нижние и верхние выносные элементы. Измеряется в типографских пунктах (обозначается как pt). Например, текст набранный 14 кеглем, будет равен 14 pt по высоте.</p>

    <img src="https://habrastorage.org/getpro/habr/post_images/dd0/4f8/9c1/dd04f89c1adda80e3c7f6133ef1f841c.jpg">

    <p><b>Интерлиньяж</b> — межстрочный интервал. Расстояние между базовыми линиями соседних строк.</p>

    <img src="https://habrastorage.org/getpro/habr/post_images/e43/45e/b4e/e4345eb4eb10922c42f920047e152d6a.jpg">

    <p><b>Кернинг</b> — расстояние между буквами. Основная суть кернинга — подбор различных интервалов между различными парами конкретных букв для увеличения удобочитаемости.</p>

    <p>Есть замечательная игра-тренажер — <a href="https://type.method.ac/">Kern Type</a>. Просто расставьте все буквы по местам. На самом деле это не так-то просто. Процесс достаточно сложен и требует отличного глазомера. Особенно этот опыт будет полезен при создании логотипов.</p>



    <h2 id="Что-мы-делаем-не-так?">Что мы делаем не так?</h2>

    <img src="https://habrastorage.org/getpro/habr/post_images/76f/bae/c85/76fbaec85dcc347b462ef72693cc0b6e.jpg">

    <h3>Используем большое количество шрифтов</h3>

    <p>Желательно использовать не более 3-х начертаний. Это могут быть шрифты как одной гарнитуры, так и разных. Например, гарнитура Roboto содержит довольно большое количество различных начертаний. Из них легко можно выбрать три, которые, как мы считаем, подойдут для нашего сайта. Допустим, это будут Light, Regular и Bold. Для заголовков можно использовать шрифт Bold или Light, для кнопок Bold, для основного текста Regular. Таким образом, используя одну гарнитуру, мы обеспечили наш сайт правильной типографикой. Естественно, все зависит от тематики сайта и идеи, которую вы планируете заложить в дизайн. Мой пример относится к универсальным и не претендует на что-то уникальное или неординарное.</p>

    <h3>Не знаем какого размера должен быть шрифт</h3>

    <p>Размер текста в вебе не должен быть меньше 12 пикселей. Лучший выбор — в пределах 14–18 px для основного текста. Не слишком большой и в то же время удобочитаемый. Причем, если уж мы выбрали размер 16 px, он должен оставаться 16 px на всех страницах сайта и не скакать плюс-минус 1 px от блока к блоку. Относится это и к интерлиньяжу, он везде должен быть одинаков.</p>

    <p>Размер шрифтов надо указывать целыми числами, не используя десятичныхдробей, например 16,28 px. И, конечно же, в фотошопе необходимо перевести pt в px. Для этого выбираете в меню: Редактирование — Установки — Основные. Далее — Единицы измерения и линейки. Меняете в выпадающих меню «Текст», «Линейки» пункты на пиксели. Жмете «OK».</p>

    <h3>Длина строки — разве это важно?</h3>

    <p>Длина строки не должна превышать 600 px. Это оптимальный размер для комфортного перемещения взгляда с одной строчки на другую. Очень широкую контентную часть тяжело читать — часто просто теряешь ту строчку, на которую собирался перейти после прочтения длинной предыдущей строки. Если все-таки необходимо растянуть текстовый блок на 1000 px и более по ширине, можно попробовать разбить текст на две или более колонок. Другой вариант — сделать межстрочное расстояние чуть больше обычного, чтобы визуально сильнее отделить строки друг от друга. Не забывайте разделять текст абзацами, это также поможет сделать его легко читаемым.</p>

    <h3>Интерлиньяж соответствует размеру шрифта</h3>

    <p>Расстояние между строками практически всегда должно быть больше размера шрифта. За исключением заголовков. Чтобы достигнуть баланса между текстом и «воздухом», сделайте межстрочное расстояние примерно в полтора раза больше высоты строчных букв. Или устанавливаем интерлиньяж, равный 150% размера шрифта. Например размер текста 14 px, тогда интрерлиньяж — 21 px. 14 / 2 = 7 + 14 = 21.</p>

    <h3>Выбираем любой понравившийся шрифт</h3>

    <p>Думаю, уже всем известно, что шрифты для дизайна веб-сайтов лучше всего использовать с <a href="fonts.google.com">fonts.google.com</a> и <a href="webfont.ru">webfont.ru</a>, если, конечно, заказчик не предоставил вам свой шрифт.</p>

    <h3>O Lorem, lorem...</h3>

    <p>Совершенно естественно, что при разработке сайта почти никогда не используется тот контент, который там будет — зачастую, это контента ещё просто не существует. Поэтому дизайнеры (да и верстальщики тоже) используют «рыбу» — произвольный текст, который вписывается в контентные блоки. Это довольно удобно, особенно для дизайнеров, ведь теперь пресловутый «Lorem Ipsum...» можно вставить прямо из фотошопа (Меню: Текст — Вставить Lorem Ipsum). Но для русскоязычных сайтов делать это не рекомендуется — латиница не дает представления о том, как будет выглядеть текст, набранный кириллическим шрифтом. Поэтому генератор текстов вам в помощь.</p>

    <h3>Ссылки</h3>

    <p>Проверка дизайна на правильность проста: если зритель, не притрагиваясь к мыши, может угадать, где ссылка, а где нет, — перед нами хороший сайт. Поэтому необходимо заранее продумать, как будут выглядеть все ссылки на сайте. Допустим, все кликабельные элементы — одного цвета, например красные, а не кликабельные другого — черного. Тогда никто не будет путаться.</p>

    <p>Часто встречается такое: заголовок выделен красным цветом (ведь надо его как-то выделить), дальше еще несколько очень важных фраз УТП синего цвета и все это вперемешку с обычным текстом черного цвета. В конце текста кнопочка, тоже красная. Понятно, что надо кликать на кнопку, но, оказывается, кликабельным был еще и текст, окрашенный в синий (он открывал дополнительную информацию). Но кто знал, кто знал…</p>

    <h3>Выравнивание</h3>

    <p>Есть текстовые блоки, которые очень часто выравниваются неправильно — это выравнивание по ширине, выравнивание посередине и выравнивание по правому краю. Во всех этих случаях читать текст неудобно, и визуально он выглядит непривлекательно. Выравнивание ВСЕГДА должно быть по левому краю. Даже если очень хочется сделать его по правому краю (просто потому что вам кажется — композиционно должно быть именно так) — это неправильно Исключением может быть одно или два коротких предложения, которые, скорее всего, являются подзаголовками для основного текста.</p>

    <h3>Контраст</h3>

    <p>Контраст — это одно из основных средств выразительности в дизайне. Не нужно бояться больших форм и пустых пространств! Нарочито крупная типографика становится самостоятельным элементом, не требующим дополнительных графических средств оформления. <a href="https://www.hochburg.design/de/agentur.html">Хороший пример</a> контраста в цветах, формах и размерах всех объектов.</p>

    <h3>Стили</h3>

    <p>Нужно всегда думать о том, какую информацию вы пытаетесь донести посетителю. Выбирая шрифт, следует помнить, что счастливые сообщения должны сопровождаться легкими, воздушными и мягкими формами шрифтов, в то время как сообщения каких-то более мрачных тем (например, Хэллоуин) лучше было бы сопровождать шрифтами с более жестким начертанием. С помощью типографики веб-дизайнеры подчеркивают атмосферу и стиль страницы, а также создают благотворную почву для эмоционального отклика.</p>

    <img src="https://habrastorage.org/getpro/habr/post_images/48d/41b/894/48d41b8946e1ad89d252d71824b3358b.jpg">

    <h4><i>Хорошая типографика – это качество, которое человек, заходя на ваш сайт, не замечает, но чувствует.</i></h4>

</div>

</body>
</html>

